app/controllers/api/stations_controller.rb

INSERT INTO "station_created_froms" ("station_id", "mediable_type", "mediable_id", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5) RETURNING "id"  [["station_id", 7], ["mediable_type", "Track"], ["mediable_id", 5], ["created_at", "2019-03-01 08:28:20.580887"], ["updated_at", "2019-03-01 08:28:20.580887"]]
---
    def update
        @station = Station.find(params[:id])
        @station_created_from = StationCreatedFrom.new(station_created_from_params)
        @station_created_from.save