app/controllers/api/stations_controller.rb

SELECT  "stations".* FROM "stations" WHERE "stations"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
---
    def show
        @station = Station.find(params[:id])

SELECT  "stations".* FROM "stations" WHERE "stations"."id" = $1 LIMIT $2  [["id", 10], ["LIMIT", 1]]
SELECT  "users".* FROM "users" WHERE "users"."id" = $1 LIMIT $2  [["id", 8], ["LIMIT", 1]]
INSERT INTO "stations" ("title", "created_at", "updated_at", "user_id") VALUES ($1, $2, $3, $4) RETURNING "id"  [["title", "TEST"], ["created_at", "2019-03-01 17:57:16.785580"], ["updated_at", "2019-03-01 17:57:16.785580"], ["user_id", 8]]
SELECT  "stations".* FROM "stations" WHERE "stations"."id" = $1 LIMIT $2  [["id", 7], ["LIMIT", 1]]
SELECT  "tracks".* FROM "tracks" WHERE "tracks"."id" = $1 LIMIT $2  [["id", 7], ["LIMIT", 1]]
SELECT  "albums".* FROM "albums" WHERE "albums"."id" = $1 LIMIT $2  [["id", 2], ["LIMIT", 1]]
SELECT  "artists".* FROM "artists" WHERE "artists"."id" = $1 LIMIT $2  [["id", 2], ["LIMIT", 1]]
SELECT  "tracks".* FROM "tracks" WHERE "tracks"."id" = $1 LIMIT $2  [["id", 5], ["LIMIT", 1]]
INSERT INTO "stations" ("title", "created_at", "updated_at") VALUES ($1, $2, $3) RETURNING "id"  [["title", "TEST"], ["created_at", "2019-03-01 08:25:35.479156"], ["updated_at", "2019-03-01 08:25:35.479156"]]
---
    def create
        @station = Station.new(title: params[:station][:title])
        @station.user_id = current_user.id
        mediable_id = params[:station][:mediable_id].to_i

        possible_station = StationCreatedFrom
            .where(mediable_id: mediable_id, mediable_type: params[:station][:mediable_type])
            .select {|scf| scf.station && scf.station.first_media == mediable_id && scf.station.user_id == current_user.id}

        if possible_station.length==0
            if params[:station][:mediable_type] == 'Track'
                @station.tracks.push(Track.find(mediable_id))
                @station.save
            elsif params[:station][:mediable_type] == 'Album'
                @station.albums.push(Album.find(mediable_id))
                @station.save
            elsif params[:station][:mediable_type] == 'Artist'
                @station.artists.push(Artist.find(mediable_id))
                @station.save

SELECT  "stations".* FROM "stations" WHERE "stations"."id" = $1 LIMIT $2  [["id", 5], ["LIMIT", 1]]
---
    def update
        func = params[:station][:func]
        mediable_id = params[:station][:mediable_id]
        station = Station.find(params[:id])