app/controllers/api/tracks_controller.rb

SELECT  "tracks".* FROM "tracks" WHERE "tracks"."id" = $1 LIMIT $2  [["id", 2], ["LIMIT", 1]]
SELECT  "artists".* FROM "artists" WHERE "artists"."id" = $1 LIMIT $2  [["id", 2], ["LIMIT", 1]]
---
    def show
        @track = Track.find(params[:id])
        @artist = Artist.find(@track.artist_id)

SELECT  "albums".* FROM "albums" WHERE "albums"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
---
    def index

        @tracks = Track.joins(:users).includes(:album, :artist).where(users: {id: params[:userId]})
        @artists = []
        @albums = []
        @tracks.each do |track|