app/views/api/users/show.json.jbuilder

SELECT "stations".* FROM "stations" WHERE "stations"."user_id" = $1  [["user_id", 1]]
---
json.stations do
    @user.stations.each do |station|