app/views/api/artists/_artist.json.jbuilder

json.albums do
  artist.albums.each do |album|
---
SELECT "albums".* FROM "albums" WHERE "albums"."artist_id" = $1  [["artist_id", 1]]