app/models/station.rb

SELECT "station_created_froms".* FROM "station_created_froms" WHERE "station_created_froms"."station_id" = $1  [["station_id", 10]]
---
    def first_media
        creates = StationCreatedFrom.where(station_id: self.id)